//- Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
let digitArray = ['12','23','34','45','56','67','78','89','90','99'];
for (let i=0; i<=9; i=i+1) {
    console.log(digitArray[i]);
}
//- Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
let stringArray = ['Сергій','Наталя','Михась','Анна','Віталій','Людмила','Денис','Арсен','Василь','Максим'];
for (let i=0; i<=9; i=i+1) {
    console.log(stringArray[i]);
}
//- Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
let mixArray = ['Сергій', 81, true,'Анна', 2009,'Наталя', 79, false,'Михась', 2006];
for (let i=0; i<=9; i=i+1) {
    console.log(mixArray[i]);
}